dewayne57/PIC18F__Q43/04 SPI/SPI 02 Client/uart.c
/* *****************************************************************************************
 *   File Name: uart.c
 *   Description: UART1 debug adapter that forwards legacy UART1 APIs to UARTLIB.
 ***************************************************************************************** */

#include <xc.h>
#include <stdbool.h>
#include <stdint.h>
#include "uart.h"

#ifndef _XTAL_FREQ
#define _XTAL_FREQ 64000000UL
#endif

#define UARTLIB_DEBUG_BAUD            115200UL
#define UARTLIB_DEBUG_HIGH_SPEED      1U

#if UARTLIB_DEBUG_HIGH_SPEED
#define UARTLIB_DEBUG_BRG_VALUE       ((_XTAL_FREQ / (4UL * UARTLIB_DEBUG_BAUD)) - 1UL)
#else
#define UARTLIB_DEBUG_BRG_VALUE       ((_XTAL_FREQ / (16UL * UARTLIB_DEBUG_BAUD)) - 1UL)
#endif

#define UARTLIB_TX_BUFFER_SIZE        128U

#include "../../Libraries/UARTLIB/uartlib.h"

static char g_uart1_tx_buffer[UARTLIB_TX_BUFFER_SIZE];

static uart_handle_t g_uart1 = {
    .port = UART_PORT_1,
    .fosc = _XTAL_FREQ,
    .baud_rate = UARTLIB_DEBUG_BAUD,
    .high_speed_baud = (UARTLIB_DEBUG_HIGH_SPEED != 0U),
    .data_bits = 8U,
    .parity = UART_PARITY_NONE,
    .stop_bits = UART_STOP_BITS_1,
    .flow_control = UART_FLOW_NONE,
    .tx_pin = UART_PPS_PIN_RB0,
    .rx_pin = UART_PPS_PIN_RB1,
    .rts_pin = UART_PPS_PIN_NONE,
    .cts_pin = UART_PPS_PIN_NONE,
#if UART1_VECTORED_INTERRUPTS
    .isr_mode = UART_ISR_VECTORED,
#else
    .isr_mode = UART_ISR_FLAT,
#endif
    .tx_buffer = g_uart1_tx_buffer,
    .tx_buffer_size = UARTLIB_TX_BUFFER_SIZE,
    .rx_buffer = g_uart1_tx_buffer,
    .rx_buffer_size = UARTLIB_TX_BUFFER_SIZE,
    .tx_head = 0U,
    .tx_tail = 0U,
    .rx_head = 0U,
    .rx_tail = 0U,
    .initialized = false
};

void UART1_Initialize(void)
{
    (void)UART_Open(&g_uart1);
    UART_SelectPrintfTarget(&g_uart1);
}

#if UART1_VECTORED_INTERRUPTS
void __interrupt(irq(IRQ_U1RX), low_priority) UART1_RX_ISR(void)
#else
void UART1_RX_ISR(void)
#endif
{
    UART_HandleRxInterrupt(&g_uart1);
}

#if UART1_VECTORED_INTERRUPTS
void __interrupt(irq(IRQ_U1TX), low_priority) UART1_TX_ISR(void)
#else
void UART1_TX_ISR(void)
#endif
{
    UART_HandleTxInterrupt(&g_uart1);
}

/* Pull in the shared UARTLIB implementation without copying it per project. */
#include "../../Libraries/UARTLIB/uartlib.c"


